[
  {
    "id": 1,
    "title": "Our History",
    "text": "In 1921, McLeod Young Weir was founded by four investment entrepreneurs—Donald Ivan McLeod, William Ewart Young, James Gordon Weir and John Henry Ratcliffe—with just $40,000 in capital. A hundred years on, their values of trust, teamwork, financial expertise and innovation drive ScotiaMcLeod, and our team of Advisors, as they deliver wealth management services today. \n Donald Ivan (D.I.) McLeod, born in Owen Sound, Ontario in 1886, was an avid painter and supporter of the Arts. He was a sketch partner to many of Canada’s most significant artists. \n William Ewart Young, the grandson of a Scottish settler who landed in Toronto’s Scarborough area. On McLeod Young Weir’s first day of operation, Mr. Young got busy on their only telephone making trading profits of about $650. \n James Gordon Weir served in a WWI machine gun battalion and was awarded the Military Cross and the Distinguished Service Order. His son, John Gordon Weir, became a famous WWII air force bomber, a POW, the mastermind behind the real-life “great escape” in 1943, and a spy. \n John Henry (Harry) Ratcliffe met McLeod, Young and Weir at A.E. Ames & Co. Although he was much younger than the other three men, Harry was highly respected for his good judgement on all things financial."
  },
  {
    "id": 2,
    "title": "The McLeod Tartan",
    "text": "First worn by McLeod Young Weir traders to stand out on the trading floor, the bright yellow \"loud McLeod\" ScotiaMcLeod Tartan has evolved into a symbol of the Scottish roots and values of ScotiaMcLeod: respect, integrity, honesty and loyalty. \n The team at ScotiaMcLeod is committed to a common goal—to provide exceptional wealth management and client service. \n Our culture is driven by collaboration at all levels of the organization, powered by our Advisors. Our initiatives are: \n The ScotiaMcLeod Advisory Board (SMAB), a consultation board of regional Advisors collaborating with senior management to prioritize strategies. \n Peer-to-peer best practice sharing, through the McLeod Advisor Conference (MAC)—designed, run and paid for by Advisors. \n The Share the Wealth Advisor-led program, funded by our teams’ philanthropic effort, to encourage and celebrate employee involvement and community engagement."
  },
  {
    "id": 3,
    "title": "Charitable Impact",
    "text": "Established in 1987 to celebrate McLeod Young Weir joining Scotiabank, the ScotiaMcLeod Charitable Foundation contributes to registered charities across Canada, based on a peer-reviewed selection process. Learn more at scotiamcleodcharitablefoundation.org"
  },
  {
    "id": 4,
    "title": "Supporting Canadian Art",
    "text": "In memory of D.I. McLeod, ScotiaMcLeod® is proud to support the Scotiabank Photography Award, the Scotiabank Giller Prize, and Scotiabank Group’s Fine Art Collection, which invests in Canadian artists."
  }
]
